[
  {
    "bookId": 1,
    "bookName": "The Great Gatsby",
    "author": "F. Scott Fitzgerald",
    "image": "https://i.ibb.co/ypvd6b1/great-gatsby.jpg",
    "review": "The Great Gatsby is a compelling portrayal of the American Dream in the midst of the Roaring Twenties. F. Scott Fitzgerald's prose is both lyrical and haunting as he explores themes of love, wealth, and the pursuit of happiness. Through the enigmatic Jay Gatsby and the elusive Daisy Buchanan, Fitzgerald exposes the emptiness of materialism and the fleeting nature of success.",
    "totalPages": 180,
    "rating": 4.5,
    "category": "Classic Literature",
    "tags": ["Romance", "Tragedy"],
    "publisher": "Charles Scribner's Sons",
    "yearOfPublishing": 1925
  },
  {
    "bookId": 2,
    "bookName": "To Kill a Mockingbird",
    "author": "Harper Lee",
    "image": "https://i.ibb.co/85MdpPQ/to-kill-a-mockingbird.jpg",
    "review": "To Kill a Mockingbird is a poignant exploration of racial injustice and moral growth in the American South. Harper Lee's masterpiece challenges readers to confront the realities of prejudice and empathy through the eyes of Scout Finch. Through the trial of Tom Robinson and the quiet heroism of Atticus Finch, Lee reveals the complexities of human nature and the enduring power of compassion.",
    "totalPages": 281,
    "rating": 4.8,
    "category": "Fiction",
    "tags": ["Social Issues", "Coming of Age"],
    "publisher": "J. B. Lippincott & Co.",
    "yearOfPublishing": 1960
  },
  {
    "bookId": 3,
    "bookName": "1984",
    "author": "George Orwell",
    "image": "https://i.ibb.co/QdF6LLm/1984.jpg",
    "review": "1984 is a dystopian masterpiece that serves as a stark warning against the perils of totalitarianism and government surveillance. George Orwell's chilling vision of a society controlled by Big Brother is as relevant today as it was when it was first published. Through the protagonist Winston Smith, Orwell exposes the dangers of propaganda, censorship, and the erosion of individual freedoms.",
    "totalPages": 328,
    "rating": 4.7,
    "category": "Dystopian Fiction",
    "tags": ["Totalitarianism", "Surveillance"],
    "publisher": "Secker & Warburg",
    "yearOfPublishing": 1949
  },
  {
    "bookId": 4,
    "bookName": "Pride and Prejudice",
    "author": "Jane Austen",
    "image": "https://i.ibb.co/wM24xRV/pride-and-prejudice.jpg",
    "review": "Pride and Prejudice is a timeless romance that transcends the constraints of its Regency-era setting. Jane Austen's witty and insightful prose invites readers into a world of social satire and romantic intrigue. Through the spirited Elizabeth Bennet and the proud Mr. Darcy, Austen explores themes of class, marriage, and the transformative power of love.",
    "totalPages": 279,
    "rating": 4.6,
    "category": "Romance",
    "tags": ["Regency Era", "Social Commentary"],
    "publisher": "T. Egerton, Whitehall",
    "yearOfPublishing": 1813
  },
  {
    "bookId": 5,
    "bookName": "The Catcher in the Rye",
    "author": "J.D. Salinger",
    "image": "https://i.ibb.co/qpqCRzs/catcher-in-the-rye.jpg",
    "review": "The Catcher in the Rye is an enduring coming-of-age novel that captures the angst and alienation of adolescence. J.D. Salinger's protagonist, Holden Caulfield, rebels against the phoniness of adult society while grappling with his own identity and place in the world. Through Holden's raw and authentic voice, Salinger explores themes of innocence, loss, and the search for authenticity.",
    "totalPages": 224,
    "rating": 4.4,
    "category": "Literary Fiction",
    "tags": ["Adolescence", "Alienation"],
    "publisher": "Little, Brown and Company",
    "yearOfPublishing": 1951
  },
  {
    "bookId": 6,
    "bookName": "Harry Potter and the Sorcerer's Stone",
    "author": "J.K. Rowling",
    "image": "https://i.ibb.co/HzSJR26/harry-potter.jpg",
    "review": "Harry Potter and the Sorcerer's Stone is a captivating tale that transports readers to a world of magic, wonder, and adventure. J.K. Rowling's imaginative storytelling introduces us to Harry Potter, a young wizard destined for greatness. Through friendships forged at Hogwarts School of Witchcraft and Wizardry, Harry learns the importance of courage, loyalty, and the power of love.",
    "totalPages": 320,
    "rating": 4.9,
    "category": "Fantasy",
    "tags": ["Magic", "Adventure"],
    "publisher": "Bloomsbury Publishing",
    "yearOfPublishing": 1997
  },
  {
    "bookId": 7,
    "bookName": "The Hobbit",
    "author": "J.R.R. Tolkien",
    "image": "https://i.ibb.co/YpW42yH/the-hobbit.jpg",
    "review": "The Hobbit is a captivating adventure story set in Middle-earth, filled with dwarves, elves, and dragons. J.R.R. Tolkien's classic tale follows Bilbo Baggins, a reluctant hobbit who embarks on an epic quest to reclaim the Lonely Mountain and its treasure from the fearsome dragon Smaug. Along the way, Bilbo encounters danger, friendship, and the true meaning of heroism.",
    "totalPages": 310,
    "rating": 4.7,
    "category": "Fantasy",
    "tags": ["Adventure", "Quest"],
    "publisher": "Allen & Unwin",
    "yearOfPublishing": 1937
  },
  {
    "bookId": 8,
    "bookName": "The Da Vinci Code",
    "author": "Dan Brown",
    "image": "https://i.ibb.co/cFZ3rP9/da-vinci-code.jpg",
    "review": "The Da Vinci Code is a gripping thriller that takes readers on a whirlwind journey through art, history, and religious conspiracy. Dan Brown's fast-paced narrative follows symbologist Robert Langdon and cryptologist Sophie Neveu as they unravel clues hidden in Leonardo da Vinci's works, leading to a shocking revelation that could shake the foundations of Christianity. With its intricate puzzles and unexpected twists, The Da Vinci Code keeps readers guessing until the very end.",
    "totalPages": 454,
    "rating": 4.3,
    "category": "Thriller",
    "tags": ["Conspiracy", "Art"],
    "publisher": "Doubleday",
    "yearOfPublishing": 2003
  },
  {
    "bookId": 9,
    "bookName": "The Alchemist",
    "author": "Paulo Coelho",
    "image": "https://i.ibb.co/q12Cvpg/the-alchemist.jpg",
    "review": "The Alchemist is a profound allegorical tale that inspires readers to pursue their dreams and listen to the whispers of their hearts. Paulo Coelho's enchanting story follows Santiago, a young shepherd who embarks on a journey to find his personal legend. Along the way, Santiago encounters wise mentors, tests his courage, and learns valuable lessons about the importance of faith and perseverance. The Alchemist is a timeless reminder that our dreams are within reach if we have the courage to pursue them.",
    "totalPages": 197,
    "rating": 4.6,
    "category": "Fiction",
    "tags": ["Philosophical", "Journey"],
    "publisher": "HarperCollins",
    "yearOfPublishing": 1988
  }
]
